backend/app/models/composite_sample_type.rb

INSERT INTO `composite_sample_type_recipes` (`composite_sample_type_id`, `sample_type_id`) VALUES (21, 7)
---
  def save_sample_type_ids
    sample_type_ids.each do |sample_type_id|
      # ignore invalid sample_types
      begin
        CompositeSampleTypeRecipe.create({
          composite_sample_type_id: id,
          sample_type_id: sample_type_id
        })