backend/app/models/composite_sample_type_recipe.rb

  def composite_sample_type_id?
  puts ">>> check 1"
    errors.add(:composite_sample_type_id, 'not valid')  if !CompositeSampleType.find_by(id: composite_sample_type_id)
---
SELECT `composite_sample_types`.* FROM `composite_sample_types` WHERE `composite_sample_types`.`id` = 16 LIMIT 1

  def sample_type_id?
  puts ">>> check 2"
    errors.add(:sample_type_id, 'not valid')  if !SampleType.find_by(id: sample_type_id)
---
SELECT `sample_types`.* FROM `sample_types` WHERE `sample_types`.`id` = 3 LIMIT 1