backend/app/models/container.rb

SELECT `container_types`.* FROM `container_types` WHERE `container_types`.`id` IS NULL LIMIT 1
---
  def container_type_id?
    errors.add(:container_type_id, 'not valid') if !ContainerType.find_by(id: container_type_id)

SELECT `locations`.* FROM `locations` WHERE `locations`.`id` = 0 LIMIT 1
---
  def location_id?
    if location_id
      if !Location.find_by(id: location_id)