backend/app/models/item.rb

SELECT `composite_sample_types`.* FROM `composite_sample_types` WHERE `composite_sample_types`.`id` IS NULL LIMIT 1
SELECT `sample_types`.* FROM `sample_types` WHERE `sample_types`.`id` IS NULL LIMIT 1
---
  def sample_type_id?
    if sample_class=='sample'
      if !sample_type_id
        errors.add(:sample_type_id, 'required')
      elsif !SampleType.find_by(id: sample_type_id)

SELECT `composite_sample_types`.* FROM `composite_sample_types` WHERE `composite_sample_types`.`id` = 2 LIMIT 1
---
  def composit_sample_type_id?
    if sample_class=='composite_sample'
      if !composite_sample_type_id
        errors.add(:composite_sample_type_id, 'required')
      elsif !CompositeSampleType.find_by(id: composite_sample_type_id)