backend/app/models/sample_type.rb

  def sample_type_category_id?
    errors.add(:sample_type_category_id, 'not valid')  if !SampleTypeCategory.find_by(id: sample_type_category_id)
---
SELECT `sample_type_categories`.* FROM `sample_type_categories` WHERE `sample_type_categories`.`id` IS NULL LIMIT 1