backend/app/controllers/api/v1/composite_sample_types_controller.rb

INSERT INTO `composite_sample_types` (`name`, `description`, `composite_sample_class`) VALUES ('var', 'var desc', 'variable')
INSERT INTO `composite_sample_types` (`name`, `description`, `composite_sample_class`) VALUES ('asdf', 'asdf', 'fixed')
---
      def create
        composite_sample_type_params = params.require(:composite_sample_type).permit!

        # pass to model and use Input.text and Input.int to scrub parameters
        composite_sample_type = CompositeSampleType.new(composite_sample_type_params)

        # return status :ok for form errors
        render json: {errors: composite_sample_type.errors.full_messages}.to_json, status: :ok and return if !composite_sample_type.save


        # save the sample type ids
        composite_sample_type.save_sample_type_ids if composite_sample_type.composite_sample_class == "fixed"