backend/app/controllers/api/v1/containers_controller.rb

INSERT INTO `containers` (`name`, `description`, `container_type_id`, `location_id`, `location`) VALUES ('testing', 'testing 2', 2, 1, '1.4.10')
---
      def create
        container_params = params.require(:container).permit!

        # pass to model and use Input.text and Input.int to scrub parameters
        container = Container.new(container_params)
        container.location_id = nil if container.location_id == 0
        container.location = nil if container.location == ''

        # return status :ok for form errors
        render json: {errors: container.errors.full_messages}.to_json, status: :ok and return if !container.save