backend/app/controllers/api/v1/container_types_controller.rb

      def create
        container_type_params = params.require(:container_type).permit!

        # pass to model and use Input.text and Input.int to scrub parameters
        container_type = ContainerType.new(container_type_params)

        # return status :ok for form errors
        render json: {errors: container_type.errors.full_messages}.to_json, status: :ok and return if !container_type.save
---
INSERT INTO `container_types` (`name`, `description`, `container_class`, `rows`, `columns`, `max_volume`) VALUES ('collection', '4-10-20', 'single', 4, 10, 20)