backend/app/controllers/api/v1/items_controller.rb

      def create
        item_params = params.require(:item).permit!

        # pass to model and use Input.text and Input.int to scrub parameters
        item = Item.new(item_params)

        item.sample_type_id = nil if item.sample_type_id == 0 or item.sample_class != 'sample'
        item.composite_sample_type_id = nil if item.composite_sample_type_id == 0 or item.sample_class != 'composite_sample'
        item.container_id = nil if item.container_id == 0
        # move location to container.create
        # item.location_id = nil if item.location_id == 0
        # item.location = nil if item.location == ''

        # return status :ok for form errors
        render json: {errors: item.errors.full_messages}.to_json, status: :ok and return if !item.save
---
INSERT INTO `items` (`name`, `description`, `sample_class`, `composite_sample_type_id`, `container_id`) VALUES ('asdfasf', 'adfasdf', 'composite_sample', 1, 4)