backend/app/controllers/api/v1/locations_controller.rb

INSERT INTO `locations` (`name`, `description`, `spec_json`, `spec_labels`, `spec_sizes`) VALUES ('one-two-three', 'testing', '[{\"label\":\"one\",\"size\":1},{\"label\":\"two\",\"size\":10},{\"label\":\"three\",\"size\":80}]', 'one.two.three', '1.10.80')
---
      def create
        location_params = params.require(:location).permit!

        # pass to model and use Input.text and Input.int to scrub parameters
        location = Location.new(location_params)

        # add specification from labels / sizez
        pl = location_params[:labels]
        ps = location_params[:sizes]
        json_spec = []
        ll = []
        ss = []
        pl.each_with_index do |pll, index|
          l = pll.strip == "" ? "Label" : pll.strip
          s = ps[index].to_i < 1 ? 1 : ps[index].to_i
          json_spec << { label: l, size: s }
          ll << l
          ss << s
        end
        location.spec_json = json_spec.to_json
        location.spec_labels = "#{ll.join(".")}"
        location.spec_sizes = "#{ss.join(".")}"

        # return status :ok for form errors
        render json: {errors: location.errors.full_messages}.to_json, status: :ok and return if !location.save