backend/app/controllers/api/v1/sample_types_controller.rb

INSERT INTO `sample_types` (`name`, `description`, `sample_type_category_id`) VALUES ('abc', 'def', 4)
---
      def create
        sample_type_params = params.require(:sample_type).permit!

        # pass to model and use Input.text and Input.int to scrub parameters
        sample_type = SampleType.new(sample_type_params)

        # return status :ok for form errors
        render json: {errors: sample_type.errors.full_messages}.to_json, status: :ok and return if !sample_type.save