backend/app/controllers/api/v1/sample_type_categories_controller.rb

      def create
        container_params = params.require(:sample_type_category).permit!

        # pass to model and use Input.text and Input.int to scrub parameters
        container = SampleTypeCategory.new(container_params)

        # return status :ok for form errors
        render json: {errors: container.errors.full_messages}.to_json, status: :ok and return if !container.save
---
INSERT INTO `sample_type_categories` (`name`, `description`) VALUES ('sweetener', 'sweeteners')